Revit 2024 API
HorizontalCurveEndpoint Class
 Represents an endpoint (start or end) of a horizontal curve in Alignment geometry.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public class HorizontalCurveEndpoint
Visual Basic
Public Class HorizontalCurveEndpoint
Visual C++
public ref class HorizontalCurveEndpoint
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Infrastructure.HorizontalCurveEndpoint
See Also
HorizontalCurveEndpoint Members
Autodesk.Revit.DB.Infrastructure Namespace